Revit 2027 API
NumberingFormatSettings.FirstNumberFormattingOption Property
 The formatting options for the start of a sequence.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FirstNumberFormattingOptions FirstNumberFormattingOption { get; set; }
Public Property FirstNumberFormattingOption As FirstNumberFormattingOptions
	Get
	Set
public:
property FirstNumberFormattingOptions FirstNumberFormattingOption {
	FirstNumberFormattingOptions get ();
	void set (FirstNumberFormattingOptions value);
}
member FirstNumberFormattingOption : FirstNumberFormattingOptions with get, set
Property Value
FirstNumberFormattingOptions
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
NumberingFormatSettings Class
Autodesk.Revit.DB Namespace